In [1]:
import pandas as pd
data = pd.read_csv("./data/dataset_rain.csv")
# 读取前2行
data.head(2)

,Day,Month,Year,MinPressure,MaxPressure,MinVapour,MaxVapour,MinRelativeHumidity,MaxRelativeHumidity,MinTemperature,MaxTemperature,Rain,MinRadiation,MaxRadiation
0,1,1,1989,1013.9,1018.9,15.8,15.1,67,71,25.5,14.1,0.0,NaN,NaN
1,2,1,1989,1015.5,1017.5,14.3,16.5,51,77,26.3,15.0,0.0,NaN,NaN

In [2]:
# 查看形状
data.shape

(2484, 14)

In [3]:
# 查看列表名称
data.columns

Index(['Day', 'Month', 'Year', 'MinPressure', 'MaxPressure', 'MinVapour',
       'MaxVapour', 'MinRelativeHumidity', 'MaxRelativeHumidity',
       'MinTemperature', 'MaxTemperature', 'Rain', 'MinRadiation',
       'MaxRadiation'],
      dtype='object')

In [4]:
# 查看索引项
data.index

RangeIndex(start=0, stop=2484, step=1)

In [5]:
# 查看没列的数据类型
data.dtypes

Day                      int64
Month                    int64
Year                     int64
MinPressure            float64
MaxPressure            float64
MinVapour              float64
MaxVapour              float64
MinRelativeHumidity      int64
MaxRelativeHumidity      int64
MinTemperature         float64
MaxTemperature         float64
Rain                   float64
MinRadiation           float64
MaxRadiation           float64
dtype: object

DataFrame
二维数组、表格
Series一维数据

In [6]:
import numpy as np

In [7]:
# 创建
s1 = pd.Series([1,'a',5.2,7])
s1

0      1
1      a
2    5.2
3      7
dtype: object

In [8]:
# 获取索引
s1.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
# 获取数据
s1.values

array([1, 'a', 5.2, 7], dtype=object)

In [10]:
# 创建标签索引的series
s2 = pd.Series([1,'a',5.2,7],index=['a','1','c','2'])
s2

a      1
1      a
c    5.2
2      7
dtype: object

In [11]:
# 使用字典创建
sdata = {'a':123,'b':456,'lph':'LPH','d':'哈哈哈'}
s3 = pd.Series(sdata)
s3

a      123
b      456
lph    LPH
d      哈哈哈
dtype: object

In [12]:
# 查询数据
s3['lph']
type(s3['lph'])

str

In [13]:
# 查询多个
s3[['a','lph']]

a      123
lph    LPH
dtype: object

In [14]:
# DataFreme 行+列

In [15]:
data = {
    'A':['a','b','c','d','e'],
    'B':['1','2','3','4','5'],
    'C':[1.1,1.2,1.3,1.4,1.5]
}
df = pd.DataFrame(data)
df

   A  B    C
0  a  1  1.1
1  b  2  1.2
2  c  3  1.3
3  d  4  1.4
4  e  5  1.5

In [16]:
# 查看类型
df.dtypes

A     object
B     object
C    float64
dtype: object

In [17]:
# 列索
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
# 从DataFreame查询series
# 查询列
df['A']

0    a
1    b
2    c
3    d
4    e
Name: A, dtype: object

In [20]:
# 查询多列
df[['A','C']]

   A    C
0  a  1.1
1  b  1.2
2  c  1.3
3  d  1.4
4  e  1.5

In [21]:
# 查询一行
df.loc[1]

A      b
B      2
C    1.2
Name: 1, dtype: object

In [22]:
# 查询多行
df.loc[1:3]

   A  B    C
1  b  2  1.2
2  c  3  1.3
3  d  4  1.4

In [23]:
df

   A  B    C
0  a  1  1.1
1  b  2  1.2
2  c  3  1.3
3  d  4  1.4
4  e  5  1.5

# 查询数据

In [24]:
import pandas as pd
df = pd.read_csv('./data/dataset_rain.csv')
df.head(3)

,Day,Month,Year,MinPressure,MaxPressure,MinVapour,MaxVapour,MinRelativeHumidity,MaxRelativeHumidity,MinTemperature,MaxTemperature,Rain,MinRadiation,MaxRadiation
0,1,1,1989,1013.9,1018.9,15.8,15.1,67,71,25.5,14.1,0.0,NaN,NaN
1,2,1,1989,1015.5,1017.5,14.3,16.5,51,77,26.3,15.0,0.0,NaN,NaN
2,3,1,1989,1013.8,1017.5,15.2,16.9,57,77,26.5,13.7,0.0,NaN,NaN

In [25]:
# 设定索引
df.head(3)

,Day,Month,Year,MinPressure,MaxPressure,MinVapour,MaxVapour,MinRelativeHumidity,MaxRelativeHumidity,MinTemperature,MaxTemperature,Rain,MinRadiation,MaxRadiation
0,1,1,1989,1013.9,1018.9,15.8,15.1,67,71,25.5,14.1,0.0,NaN,NaN
1,2,1,1989,1015.5,1017.5,14.3,16.5,51,77,26.3,15.0,0.0,NaN,NaN
2,3,1,1989,1013.8,1017.5,15.2,16.9,57,77,26.5,13.7,0.0,NaN,NaN

In [26]:

df2 = pd.read_csv("./data/test2.csv")
df2.head(3)

   data   regin    sum
0  1001  regin1  0.1cc
1  1002  regin2  0.2cc
2  1003  regin3  0.3cc

In [27]:
# 替换小数点字符
df2.loc[:,"sum"] = df2["sum"].str.replace("cc","").astype("float")
df2.dtypes

data       int64
regin     object
sum      float64
dtype: object

In [28]:
import pandas as pd
data = pd.read_csv("./data/test2.csv")
data.set_index("data", inplace=True)

print(data.index)
print(data.loc[1001,"sum"])

Int64Index([1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009], dtype='int64', name='data')
0.1cc

In [29]:
import pandas as pd
data = pd.read_csv("./data/test2.csv")
# 修改字符
data.loc[:,"sum"] = data["sum"].str.replace("cc","").astype("float")

# 设置索引
data.set_index("data",inplace=True)
data.head()
# 获取单值
data.loc[1001,"regin"]
# 获取多值
data.loc[1002,["regin","sum"]]

# 使用值列表批量查询单值
data.loc[[1001,1003,1005],"sum"]
# 使用值列表批量查询多值
data.loc[[1001,1003,1005],["sum","regin"]]

# 使用数值区间
data.loc[1001:1004,"sum"]

# 列index按照区间
data.loc[1001,"regin":"sum"]

# 行列区间
data.loc[1001:1004,"regin":"sum"]

# 条件表达式查询
data.loc[data["sum"]<0.3,:]
# 返回布尔值 符合为True 否则为False
data["sum"]<0.4

# 复杂查询条件
data.loc[(data["sum"]<0.4) & (data["regin"]=="regin3")]

       regin  sum
data
1003  regin3  0.3

In [30]:
import pandas as pd
data = pd.read_csv("./data/test2.csv")


# 设置索引
data.set_index("data",inplace=True)
data.head()

# 新增数据列
# 1.直接赋值
data.loc[:,"sum"] = data["sum"].str.replace("cc","").astype("float")

# 2.新增列
data.loc[:,"sum2"] = data["sum"] * 2
data.head()

# 3.df.apply
def get_sum(x):
    if x["sum2"] > 0.5:
        return "优秀"
    return "一般"

data.loc[:,"sum2"] = data.apply(get_sum,axis=1)
data.head()

# 根据类型计数
data["sum2"].value_counts()

# 4.df.assign
# 同时添加多个列 x与y
data.assign(
    x = lambda x : x["sum"]*3,
    y = lambda x : x["sum"]*2
)

# 5.按条件选择分组分别赋值
# 创建空列
data["my"] = ""
data.head()
data.loc[data["sum"]>0.4,"my"] = "秀儿"
data.loc[data["sum"]<=0.4,"my"] = "细狗"
data.head()

       regin  sum sum2  my
data
1001  regin1  0.1   一般  细狗
1002  regin2  0.2   一般  细狗
1003  regin3  0.3   优秀  细狗
1004  regin1  0.4   优秀  细狗
1005  regin2  0.5   优秀  秀儿

In [31]:
# 数据统计函数
import pandas as pd
data = pd.read_csv("./data/test2.csv")
data.loc[:,"sum"] = data["sum"].str.replace("cc","").astype("float")

# 汇总类
# 1.提取所有数字列结果
data.describe()

# 2.查看单个Series的数据 平均值
data["sum"].mean()
# 最大值
data["sum"].max()
# 最小值
data["sum"].min()

# 唯一去重
data["regin"].unique()

# 按值计数 每个值出现几次
data["sum"].value_counts()

# 协方差矩阵
data.cov()

      data    sum
data  7.50  0.750
sum   0.75  0.075

In [32]:
# 相关系数矩阵
data.corr()
# data.head()

      data  sum
data   1.0  1.0
sum    1.0  1.0

In [34]:
# 单独查看data与sum的相关系数
data["data"].corr(data["sum"])

1.0

In [37]:
# 对缺失值的处理
import pandas as pd
# 读取时忽略前两行
data = pd.read_excel("./data/student-old.xls",skiprows=2)
data

    Unnamed: 0   姓名   科目    分数
0          NaN   小明   语文  85.0
1          NaN  NaN   数学  80.0
2          NaN  NaN   英语  90.0
3          NaN  NaN  NaN   NaN
4          NaN   小王   语文  85.0
5          NaN  NaN   数学   NaN
6          NaN  NaN   英语  90.0
7          NaN  NaN  NaN   NaN
8          NaN   小刚   语文  85.0
9          NaN  NaN   数学  80.0
10         NaN  NaN   英语  90.0

In [38]:
# 检测空值
data.isnull()

    Unnamed: 0     姓名     科目     分数
0         True  False  False  False
1         True   True  False  False
2         True   True  False  False
3         True   True   True   True
4         True  False  False  False
5         True   True  False   True
6         True   True  False  False
7         True   True   True   True
8         True  False  False  False
9         True   True  False  False
10        True   True  False  False

In [39]:
# 根据列判断空值
data["分数"].isnull()

0     False
1     False
2     False
3      True
4     False
5      True
6     False
7      True
8     False
9     False
10    False
Name: 分数, dtype: bool

In [40]:
# 根据列判断不为空
data["分数"].notnull()

0      True
1      True
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9      True
10     True
Name: 分数, dtype: bool

In [41]:
# 筛选出没有空分数的行
data.loc[data["分数"].notnull(),:]

    Unnamed: 0   姓名  科目    分数
0          NaN   小明  语文  85.0
1          NaN  NaN  数学  80.0
2          NaN  NaN  英语  90.0
4          NaN   小王  语文  85.0
6          NaN  NaN  英语  90.0
8          NaN   小刚  语文  85.0
9          NaN  NaN  数学  80.0
10         NaN  NaN  英语  90.0

In [42]:
# 删除掉全是空值的列
data.dropna(axis="columns",how="all",inplace=True)
data

     姓名   科目    分数
0    小明   语文  85.0
1   NaN   数学  80.0
2   NaN   英语  90.0
3   NaN  NaN   NaN
4    小王   语文  85.0
5   NaN   数学   NaN
6   NaN   英语  90.0
7   NaN  NaN   NaN
8    小刚   语文  85.0
9   NaN   数学  80.0
10  NaN   英语  90.0

In [43]:
# 删除掉全是空值的行
data.dropna(axis="index",how="all",inplace=True)
data

     姓名  科目    分数
0    小明  语文  85.0
1   NaN  数学  80.0
2   NaN  英语  90.0
4    小王  语文  85.0
5   NaN  数学   NaN
6   NaN  英语  90.0
8    小刚  语文  85.0
9   NaN  数学  80.0
10  NaN  英语  90.0

In [49]:
# 将分数列
data.fillna({"分数":0},inplace=True)
data

     姓名  科目    分数
0    小明  语文  85.0
1   NaN  数学  80.0
2   NaN  英语  90.0
4    小王  语文  85.0
5   NaN  数学   0.0
6   NaN  英语  90.0
8    小刚  语文  85.0
9   NaN  数学  80.0
10  NaN  英语  90.0

In [48]:
data.loc[:,"分数"] = data["分数"].fillna(0)
data

     姓名  科目    分数
0    小明  语文  85.0
1   NaN  数学  80.0
2   NaN  英语  90.0
4    小王  语文  85.0
5   NaN  数学   0.0
6   NaN  英语  90.0
8    小刚  语文  85.0
9   NaN  数学  80.0
10  NaN  英语  90.0

In [50]:
# 填充姓名
data.loc[:,"姓名"] = data["姓名"].fillna(method="ffill")
data

    姓名  科目    分数
0   小明  语文  85.0
1   小明  数学  80.0
2   小明  英语  90.0
4   小王  语文  85.0
5   小王  数学   0.0
6   小王  英语  90.0
8   小刚  语文  85.0
9   小刚  数学  80.0
10  小刚  英语  90.0

In [52]:
# 保存excel
data.to_excel("./data/save_student.xlsx",index=False)